---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeKey.#ctor
source: html/075e9938-be39-b27b-4583-1ec2f1cee14b.htm
---
# Autodesk.Revit.DB.ExportLinetypeKey.#ctor Method

Constructs a new default ExportLinetypeKey.

## Syntax (C#)
```csharp
public ExportLinetypeKey()
```